# MarkupsCreated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MarkupsCreated Property
ParameterTypeId Class See Also
---
"Created"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MarkupsCreated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarkupsCreated As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MarkupsCreated {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace